# Connectors Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorManager..::..Connectors Property
ConnectorManager Class See Also
---
Return all the Connectors of the Connector Manager.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ConnectorSet Connectors { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Connectors As ConnectorSet
	Get
```

Visual C++
---
```text
public:
property ConnectorSet^ Connectors {
	ConnectorSet^ get ();
}
```

# Remarks
This property is used to retrieve the Connectors from the Connector Manager.
# See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace